In [3]:
import pandas as pd 
import numpy as np
import seaborn as sns

# 1. Titanic - sns.load_dataset('titanic')

## a.타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨

### 1)20살이 넘으면 성별을 그대로 사용한다.

###  2)20살 미만이면 성별에 관계없이 “child”라고 한다.

In [4]:
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [125]:
titanic.groupby(titanic.survived).describe()

         pclass                                                 age  \
          count      mean       std  min  25%  50%  75%  max  count
survived
0         549.0  2.531876  0.735805  1.0  2.0  3.0  3.0  3.0  424.0
1         342.0  1.950292  0.863321  1.0  1.0  2.0  3.0  3.0  290.0

                     ... parch        fare                             \
               mean  ...   75%  max  count       mean        std  min
survived             ...
0         30.626179  ...   0.0  6.0  549.0  22.117887  31.388207  0.0
1         28.343690  ...   1.0  5.0  342.0  48.395408  66.596998  0.0


              25%   50%   75%       max
survived
0          7.8542  10.5  26.0  263.0000
1         12.4750  26.0  57.0  512.3292

[2 rows x 40 columns]

In [126]:
titanic['adult/child'] = titanic.apply(lambda r: r.sex if r.age >= 20 else 'child', axis=1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male

## b.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고치시오.

In [127]:
titanic.mean()['age']

29.69911764705882

In [122]:
titanic['age']=round(titanic['age'].fillna(titanic.mean()['age']))
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,30.0,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

## c.성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

In [203]:
def alivecount(x):
    return x/891

In [208]:
titanic.pivot_table('survived',['class','sex'],['embark_town'],
                 aggfunc='sum', fill_value=0).agg(alivecount)

embark_town    Cherbourg  Queenstown  Southampton
class  sex
First  female   0.047138    0.001122     0.051627
       male     0.019080    0.000000     0.031425
Second female   0.007856    0.002245     0.068462
       male     0.002245    0.000000     0.016835
Third  female   0.016835    0.026936     0.037037
       male     0.011223    0.003367     0.038159

# 2. Mile Per Gallon - sns.load_dataset('mpg')

In [3]:
mpg=sns.load_dataset('mpg')
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

## a.배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.

In [19]:
mpg['hp_per_cc'] = mpg.horsepower / mpg.displacement
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,manufacturer,model,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet,chevellemalibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick,skylark320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth,satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc,rebelsst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford,torino,0.463576

In [20]:
#b
def get_mfger(full_name):
    return full_name.split()[0]

def get_model(full_name):
    return ''.join(full_name.split()[1:])

In [21]:
a = ['I', 'am', 'a', 'student']   # ==> 'I am a student'
' '.join(x for x in a)

'I am a student'

In [22]:
' '.join(a)

'I am a student'

In [23]:
get_mfger('chevrolet chevelle malibu'), get_model('chevrolet chevelle malibu')

('chevrolet', 'chevellemalibu')

In [24]:
mpg['manufacturer'] = mpg.name.apply(get_mfger)
mpg['model'] = mpg.name.apply(get_model)
del mpg['name']
mpg.head()

AttributeError: 'DataFrame' object has no attribute 'name'


## b.name으로부터 manufacturer(제조사)와 모델을 추출하여
## 새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.


## c.엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.

In [5]:
mpg.pivot_table('mpg','cylinders')

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

In [6]:
mpg[['mpg','cylinders']].groupby('cylinders').mean()

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

In [11]:
mpg['manufacturer'] = mpg.name.apply(get_mfger)
mpg['model']= mpg.name.apply(get_model)
del mpg['name']
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet,chevellemalibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick,skylark320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc,rebelsst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford,torino

## d.생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.

In [12]:
mpg[['origin','hp_per_cc']].groupby('origin').mean()

KeyError: "['hp_per_cc'] not in index"


## e.모델이 5개 이상인 제조사에 대하여
## 연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.

In [13]:
s= mpg.manufacturer.value_counts()
big = s[s>=5].index.tolist()
print(big)

['ford', 'chevrolet', 'plymouth', 'amc', 'dodge', 'toyota', 'datsun', 'buick', 'pontiac', 'volkswagen', 'honda', 'mercury', 'oldsmobile', 'mazda', 'fiat', 'peugeot', 'audi', 'chrysler', 'volvo', 'vw', 'renault']

In [14]:
mpg[mpg['manufacturer'].isin(big)]
#in 연산자 대신에 isin() method 사용

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet,chevellemalibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick,skylark320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc,rebelsst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford,torino
...,...,...,...,...,...,...,...,...,...,...
392,27.0,4,151.0,90.0,2950,17.3,82,usa,chevrolet,camaro
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford,mustanggl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw,pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge,rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford,ranger

In [18]:
mpg[mpg['manufacturer'].isin(big)][['manufacturer','mpg']].groupby('manufacturer').mean()

                    mpg
manufacturer
amc           18.246429
audi          26.714286
buick         19.182353
chevrolet     20.472093
chrysler      17.266667
datsun        31.113043
dodge         22.060714
fiat          28.912500
ford          19.694118
honda         33.761538
mazda         30.860000
mercury       19.118182
oldsmobile    21.100000
peugeot       23.687500
plymouth      21.703226
pontiac       20.012500
renault       32.880000
toyota        28.372000
volkswagen    29.106667
volvo         21.116667
vw            39.016667